{
  "current": {
    "datetime": "Thursday August 29th, 2019 7pm",
    "date": "8/29/2019 19:00:00",
    "unixTime": 1567062000000,
    "host": {
      "address": "2401 Colorado Ave, Santa Monica, CA 90404",
      "name": "Edmunds",
      "url": "https://www.edmunds.com/careers/",
      "misc": ""
    },
    "drinks": [
      {
        "address": "2819 Pico Blvd, Santa Monica, CA 90405",
        "bookedShows": "2019-08-29",
        "id": "gdlNtRz4WuGc9UOhpHLjR57VFKIg",
        "name": "Barkowski"
      }
    ],
    "speakers": [
      {
        "title": "Five Advanced & Shiny Testing Techniques",
        "name": "Yoni Goldberg",
        "image": "https://media.publit.io/file/l6ycvvKM3tUmZ-66FJQ5QVy.jpg",
        "twitter": "nodepractices",
        "github": "goldbergyoni",
        "description": "A year ago I was tasked to test typical Microservices-based project with modern frontend and the traditional tools just didn't work for me. So I went into a journey of finding modern techniques that might score better and guess what: I discovered a handful of neat techniques that rocked my testing world. Let's discuss when the traditional testing tools fall short and how modern and emerging techniques can sometimes do better: In the past 10 years, the dev world had gone through dramatic changes but the testing models were left intact leaving us wondering how to test things like Microservice, and Serverless. This session demonstrates the new wave of testing tools (e.g. property-based testing, consumer-driven contract, fuzz, and others) and how they can better fit modern applications. This session aims to inspire with modern testing ideas, but it also packs practical and down-to-earth code demos. \n\nAbout me - Yoni Goldberg: I'm an independent consultant who works with 500 fortune corporates and garage startups on polishing their JS & Node.js applications. I'm also the author of Node's largest best practices collection: https://github.com/i0natan/nodebestpractices",
        "video": "",
        "videoimg": ""
      },
      {
        "title": "How to Sell Testing to Your Team (Without Being a Jerk)",
        "name": "James Hush",
        "image": "https://media.publit.io/file/6mRAj_2Vh2lHMy_MaRR4Oonc.png",
        "twitter": "",
        "github": "jamsea",
        "description": "This is a story of how we were able to go from zero automated testing, static analysis, end to end testing, and a lot of wasted time, broken deploys and pager duty requests to being able to deploy changes on a Friday at 5pm. I did this by slowly getting buy in from team members over the course of the first year I was working at System1 and introducing checks and tests slowly, instead of doing what many well meaning engineers do of trying to introduce too much all at once. \n\nTurning on tests 100% in a blank document is easy, integrating it into a 4+ year code base is not.\n\nI'll cover:\n1. The point of testing (it's actually to speed up releases, not necessarily catching bugs!)\n2. The low hanging fruit big wins you can make at work tomorrow (it's not trying to convince business to give you 4 weeks to write write brittle end to end tests and not push out features).\n3. The tricks to introduce eslint, Typescript, Jest, and Mabl/Cypress slowly without annoying other engineers to the point of them just turning it off.\n4. The before and after results of how testing has speed up System1's frontend team to release 2-3 times a day without breaking a sweat instead of a once a week ordeal.",
        "video": "",
        "videoimg": ""
      }
    ],
    "sponsors": [
      {
        "name": "Edmunds",
        "logo": "https://5c01b9f7f6d5ea39c04ea7ba--jsla.netlify.com/images/hosts/host-edmunds.png",
        "url": "https://www.edmunds.com/careers/"
      },
      {
        "name": "PickTrace, Inc.",
        "logo": "https://i.imgur.com/MTPSLJ7.png",
        "url": "http://www.picktrace.com"
      }
    ]
  },
  "next": {
    "datetime": "Thursday September 26th, 2019 7pm",
    "date": "9/26/2019 19:00:00",
    "unixTime": 1569481200000,
    "host": {
      "address": "2301 Rosecrans Ave, El Segundo, CA 90245",
      "name": "Publicis Sapient",
      "url": "https://www.publicissapient.com/",
      "misc": ""
    },
    "drinks": [],
    "speakers": [
      {
        "title": "Type it up with Typescript",
        "name": "Alex Tamoykin",
        "image": "https://pbs.twimg.com/profile_images/857096216684965888/iRmlafTf_400x400.jpg",
        "twitter": "fsproru",
        "github": "fsproru",
        "description": "Javascript is easy to start with and it's easy to shoot yourself in a foot due to loose typing. Typescript brings in the best of both worlds. It adds types, interfaces, inheritance, and all that good stuff which makes it a safe and more efficient language to use. With growing community around it and full Javascript support out of the box, it makes Typescript a great candidate to take your Javascript codebase to the next level. After listening to this talk you'll have a good understanding of how to use Typescript for your project.",
        "video": "",
        "videoimg": ""
      },
      {
        "title": "Codechella: How we locked ourselves in a cabin for a week and rebuilt Joymode",
        "name": "Jon Jandoc",
        "image": "https://media.publit.io/file/-I8I0tp1fShCVhiEGBSw8JJO.jpg",
        "twitter": "jokeisup",
        "github": "jjandoc",
        "description": "When I started at Joymode almost a year and a half ago, I was brought on as their first strictly front-end developer tasked with updating their front-end stack. Within a year, we went form a slow CoffeeScript/jQuery app on Rails, to a modern decoupled Vue app on the JAMstack. My talk goes into the motivations for migrating, my push for using Vue when the team had already convinced themselves prior to using React, and the strategies to progressively move over a large legacy codebase to a modern framework while still running a business. Finally, I can reflect on what went well and what didn't.",
        "video": "",
        "videoimg": ""
      }
    ],
    "sponsors": [
      {
        "name": "Publicis Sapient",
        "logo": "https://media.publit.io/file/pWP1HXVzrNahIdZ1jj-SBMf6.png",
        "url": "https://www.publicissapient.com/"
      },
      {
        "name": "InfluxData",
        "logo": "https://media.publit.io/file/UWY6aU6lkT3dSkhi-V4tseMM.png",
        "url": "influxdata.com"
      }
    ]
  }
}