{
  "current": {
    "datetime": "Thursday June 27th, 2019 7pm",
    "date": "6/27/2019 19:00:00",
    "unixTime": 1561618800000,
    "host": {
      "address": "990 W 8th Street Suite 600 Los Angeles CA 90017",
      "name": "Honey",
      "url": "https://www.joinhoney.com/",
      "misc": ""
    },
    "drinks": [
      {
        "address": "417 W 8th St Los Angeles, CA 90014",
        "bookedShows": "2019-06-27",
        "id": "UgQjszl4gN27YkknJIPu4IVKZndH",
        "name": "Golden Gopher"
      }
    ],
    "speakers": [
      {
        "title": "Put Some Respek on My Name",
        "name": "Gerard O'Neill",
        "image": "https://avatars2.githubusercontent.com/u/748180",
        "twitter": "grardb",
        "github": "grardb",
        "description": "This is a talk about all the problems that occur when programmers try to validate and sanitize names. My last name has an apostrophe, and it's a horrible experience. I know someone whose first name is one letter. I have friends with accented characters in their names.\n\nProgrammers do a horrible job of respecting people's monikers, so I am on a mission to make people understand the flaws in their ways.\n\nI recently gave a shorter version of this talk: https://www.youtube.com/watch?v=YFEO0qKYaiU",
        "video": "",
        "videoimg": ""
      },
      {
        "title": "11 Years of Having No Idea of What I’m Doing ",
        "name": "Angus Perkerson",
        "image": "https://media.publit.io/file/HJNC7p_qPT7o-FI5tOoBjgd4.png",
        "twitter": "angusp",
        "github": "anguspiv",
        "description": "Imposter Syndrome is okay. It’s okay to feel like you don’t know what you’re doing at your job, that’s your job as a Software Engineer.\n\nIn all 11 years of my career, every job I’ve had to learn there tech stack on the job, whether it was backbone, angularjs, or react. Instead what helped me in my career was focusing on the basics of programming and algorithms, and understanding the JavaScript Language itself.\n\nI want to share my story of how for every job I’ve had there we’re several moments where I had no idea what I was doing, but by focusing what I did know, and learning the foundations of what I needed to know. I’ve been able to build a pretty successful career.\n\nTLDR;\nFeeling like you don’t know what your doing is okay. Learn JavaScript not React, and you’ll be fine.",
        "video": "",
        "videoimg": ""
      }
    ],
    "sponsors": [
      {
        "name": "Honey",
        "logo": "https://cl.ly/3980178707e6/Image%2525202019-06-04%252520at%2525207.00.29%252520PM.png",
        "url": "https://www.joinhoney.com/"
      },
      {
        "name": "Polycade Inc.",
        "logo": "https://media.publit.io/file/hUezQetp-kjJlJ0t4JN8wmeB.png",
        "url": "https://angel.co/company/polycade/jobs/418438-full-stack-developer-nodejs-windows"
      }
    ]
  },
  "next": {
    "datetime": "Thursday July 25th, 2019 7pm",
    "date": "7/25/2019 19:00:00",
    "unixTime": 1564038000000,
    "host": {
      "address": "320 Hampton Drive Venice CA 90291",
      "name": "Google",
      "url": "https://www.google.com/about/locations/los-angeles/",
      "misc": ""
    },
    "drinks": [],
    "speakers": [
      {
        "title": "Full Stack Development in the Era of Serverless Computing",
        "name": "Nader Dabit",
        "image": "https://i.imgur.com/3NusHsX.jpg",
        "twitter": "dabit3",
        "github": "dabit3",
        "description": "When people think about cloud computing, they typically think about servers & back end development. This is starting to change.\n\nWith the emergence of more & more powerful & sophisticated managed services like AWS AppSync, Cloudinary, Algolia, Auth0 & Firebase, it's completely possible for front-end engineers to build full-stack web & mobile applications with almost no back-end code, relying on these services to do the heavy lifting for features like data layers, search, authentication, authorization, & more.\n\nIn this talk, I'll talk about this philosophy in depth, discuss the options available from different service providers, & then show how (live-code) to build a full-stack web application in just a few minutes by using React & AWS Amplify to quickly build a real-world application complete with a GraphQL API, authentication & authorization, & hosting.\n",
        "video": "",
        "videoimg": ""
      },
      {
        "title": "The Lost Art of MIDI – Bringing < bgsound > Back to the Web",
        "name": "Feross Aboukhadijeh",
        "image": "https://feross.org/images/feross-insta.jpg",
        "twitter": "feross",
        "github": "feross",
        "description": "In the days of Geocities and Angelfire, a quirky HTML tag called < bgsound > enabled sound files to play in the background of webpages. Usually, these files were in the MIDI format. What a glorious era that was! Sadly, < bgsound > has been removed from browsers and MIDI is obscure and hard to play back. In this talk, we'll bring MIDI and < bgsound > back from the dead using WebAssembly, Emscripten, Web Audio, and Web Components. When we're finished, you'll be able to give your webpages the 90's treatment in a modern, standards-compliant way!",
        "video": "",
        "videoimg": ""
      }
    ],
    "sponsors": [
      {
        "name": "Google",
        "logo": "https://lh3.googleusercontent.com/-ZxK7RcVQdOE/Vd5bJfv4tYI/AAAAAAAAQ70/p8tAh6KU-OQfaAEiXteXDCpzLXe1jag6gCHM/d/logo_420_color_2x.png",
        "url": "https://www.google.com/about/locations/los-angeles/"
      },
      {
        "name": "Unanimous AI",
        "logo": "https://media.publit.io/file/30RTHTIeQFvffBSQ4b4pd1SU.png",
        "url": "https://unanimous.ai/"
      }
    ]
  }
}