{
  "current": {
    "datetime": "Thursday July 25th, 2019 7pm",
    "date": "7/25/2019 19:00:00",
    "unixTime": 1564038000000,
    "host": {
      "address": "320 Hampton Drive Venice CA 90291",
      "name": "Google",
      "url": "https://www.google.com/about/locations/los-angeles/",
      "misc": ""
    },
    "drinks": [
      {
        "address": "625 Lincoln Blvd, Los Angeles, CA 90291",
        "bookedShows": "2019-07-25",
        "id": "Velc5IyfoPAoB1B4jNx4XIodNEhx",
        "name": "Wurstkuche"
      }
    ],
    "speakers": [
      {
        "title": "Become a 10x Engineer",
        "name": "Jacob Lowe",
        "image": "https://media.publit.io/file/dVCBv3M8To22w3ADuja6pJv8.jpg",
        "twitter": "jcblw",
        "github": "jcblw",
        "description": "Do not burn yourself out. Sitting at my desk, I had an overwhelming feeling doing too much but also getting nothing done. I would look back at my time and think I did a lot of things, but I just do not recollect any of them. It's like my body was on autopilot and my mind was taking a nap.",
        "video": "",
        "videoimg": ""
      },
      {
        "title": "Curious Cases of GraphQL",
        "name": "Nader Dabit",
        "image": "https://i.imgur.com/3NusHsX.jpg",
        "twitter": "dabit3",
        "github": "dabit3",
        "description": "As GraphQL moves into the mainstream, the tooling, ecosystem, and services supporting it have grown and have made it possible to do much more with GraphQL than using it as just a data layer. In this talk, I'll show how developers are using GraphQL as an API gateway to accomplish things that you may have never thought possible.",
        "video": "",
        "videoimg": ""
      }
    ],
    "sponsors": [
      {
        "name": "Google",
        "logo": "https://lh3.googleusercontent.com/-ZxK7RcVQdOE/Vd5bJfv4tYI/AAAAAAAAQ70/p8tAh6KU-OQfaAEiXteXDCpzLXe1jag6gCHM/d/logo_420_color_2x.png",
        "url": "https://www.google.com/about/locations/los-angeles/"
      },
      {
        "name": "PickTrace, Inc.",
        "logo": "https://i.imgur.com/MTPSLJ7.png",
        "url": "http://www.picktrace.com"
      }
    ]
  },
  "next": {
    "datetime": "Thursday August 29th, 2019 7pm",
    "date": "8/29/2019 19:00:00",
    "unixTime": 1567062000000,
    "host": {
      "address": "2401 Colorado Ave, Santa Monica, CA 90404",
      "name": "Edmunds",
      "url": "https://www.edmunds.com/careers/",
      "misc": ""
    },
    "drinks": [],
    "speakers": [
      {
        "title": "5 advanced & shiny testing techniques",
        "name": "Yoni Goldberg",
        "image": "https://media.publit.io/file/l6ycvvKM3tUmZ-66FJQ5QVy.jpg",
        "twitter": "nodepractices",
        "github": "https://github.com/i0natan/nodebestpractices",
        "description": "Quick intro: I live in Israel and stumbled an opportunity to visit LA for a few days in August. See links with my BIO \n- https://www.goldbergyoni.com\n- https://github.com/i0natan/nodebestpractices\n\nMy love and passion is testing, I work with ~ 10 customers/year on polishing their testing skills. \n\n--\n\nTalk title: 5 advanced & shiny testing techniques\n\nTalk abstract: A year ago I was tasked to test typical Microservices-based project and the traditional tools just didn't work for me. So I went into a journey of finding modern techniques that might score better and guess what: I discovered a handful of neat techniques that rocked my testing world\n\nLet's discuss when the traditional testing tools fall short and how modern and emerging techniques can sometimes do better: In the past 10 years, the dev world had gone through dramatic changes but the testing models were left intact leaving us wondering how to test things like Microservice, and Serverless. This session demonstrates the new wave of testing tools (e.g. property-based testing, consumer-driven contract, fuzz, and others) and how they can better fit modern applications. This session aims to inspire with modern testing ideas, but it also packs practical and down-to-earth code demos",
        "video": "",
        "videoimg": ""
      },
      {
        "title": "How to Sell Testing to Your Team (Without Being a Jerk)",
        "name": "James Hush",
        "image": "https://media.publit.io/file/6mRAj_2Vh2lHMy_MaRR4Oonc.png",
        "twitter": "",
        "github": "jamsea",
        "description": "This is a story of how we were able to go from zero automated testing, static analysis, end to end testing, and a lot of wasted time, broken deploys and pager duty requests to being able to deploy changes on a Friday at 5pm. I did this by slowly getting buy in from team members over the course of the first year I was working at System1 and introducing checks and tests slowly, instead of doing what many well meaning engineers do of trying to introduce too much all at once. \n\nTurning on tests 100% in a blank document is easy, integrating it into a 4+ year code base is not.\n\nI'll cover:\n1. The point of testing (it's actually to speed up releases, not necessarily catching bugs!)\n2. The low hanging fruit big wins you can make at work tomorrow (it's not trying to convince business to give you 4 weeks to write write brittle end to end tests and not push out features).\n3. The tricks to introduce eslint, Typescript, Jest, and Mabl/Cypress slowly without annoying other engineers to the point of them just turning it off.\n4. The before and after results of how testing has speed up System1's frontend team to release 2-3 times a day without breaking a sweat instead of a once a week ordeal.",
        "video": "",
        "videoimg": ""
      }
    ],
    "sponsors": [
      {
        "name": "Edmunds",
        "logo": "https://5c01b9f7f6d5ea39c04ea7ba--jsla.netlify.com/images/hosts/host-edmunds.png",
        "url": "https://www.edmunds.com/careers/"
      }
    ]
  }
}